4ops.terraform
adpyke.vscode-sql-formatter
betterthantomorrow.calva
betterthantomorrow.calva-spritz
djblue.portal
dongfg.vscode-beancount-formatter
dotjoshjohnson.xml
eamodio.gitlens
genieai.chatgpt-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
gurumukhi.selected-lines-count
jannisx11.batch-rename-extension
juanblanco.solidity
lencerf.beancount
mikoz.autoflake-extension
misogi.ruby-rubocop
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.live-server
ms-vscode.remote-explorer
ms-vscode.remote-server
openai.openai-chatgpt-adhoc
redhat.vscode-yaml
richie5um2.vscode-sort-json
rokoroku.vscode-theme-darcula
shd101wyy.markdown-preview-enhanced
shopify.ruby-lsp
sporto.rails-go-to-spec
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-german
tomoki1207.pdf
usernamehw.commands
yzhang.markdown-all-in-one
