tap "anomalyco/tap"
tap "babashka/brew"
tap "borkdude/brew"
tap "clojure-lsp/brew"
tap "colindean/fonts-nonfree"
tap "elastic/tap"
tap "gcenx/wine"
tap "henry-p/tap"
tap "homebrew/cask"
tap "homebrew/core"
tap "kegworks-app/kegworks"
tap "nikitabobko/tap"
tap "reviewdog/tap"
tap "rhyeal/aws-rotate-iam-keys", "https://github.com/rhyeal/aws-rotate-iam-keys"
tap "sambadevi/powerlevel9k"
tap "steveyegge/beads"
tap "supabase/tap"
# Run your GitHub Actions locally
brew "act"
# Simple, modern, secure file encryption
brew "age"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Next generation open source RPC library and framework
brew "grpc"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Core application library for C
brew "glib"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# YAML Parser
brew "libyaml"
# Client for Amazon Elastic Beanstalk web service
brew "aws-elasticbeanstalk"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Double-entry accounting tool that works on plain text files
brew "beancount"
# Python code formatter
brew "black"
# Collection of portable C++ source libraries
brew "boost"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# GNU multiple precision arithmetic library
brew "gmp"
# Computational Geometry Algorithms Library
brew "cgal"
# OpenType text shaping engine
brew "harfbuzz"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Dynamic, general-purpose programming language
brew "clojure"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# Utility that creates projects from templates
brew "cookiecutter"
# Reimplementation of ctags(1)
brew "ctags"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Web interface for the double-entry bookkeeping software Beancount
brew "fava"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Multi-agent workspace manager
brew "gastown"
# GNU compiler collection
brew "gcc"
# New file format for still image compression
brew "jpeg-xl"
# Library for encoding and decoding .avif files
brew "libavif"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Graphics library to dynamically manipulate images
brew "gd"
# Geometry Engine
brew "geos"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Assuan IPC Library
brew "libassuan"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# File format designed to store large amounts of data
brew "hdf5"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Generic library support script
brew "libtool"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# C++ wrapper library around CGAL
brew "sfcgal"
# Geospatial Data Abstraction Library
brew "gdal"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# GitHub command-line tool
brew "gh"
# Image processing and image analysis library
brew "leptonica"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Open GitHub webpages from a terminal
brew "git-open"
# Official GitLab CI runner
brew "gitlab-runner"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Image manipulation
brew "netpbm"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Kubernetes package manager
brew "helm"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# String tool
brew "intltool"
# Interactive computing in Python
brew "ipython"
# Image manipulation library
brew "jpeg"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes prompt info for bash and zsh
brew "kube-ps1"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Build tool for Clojure
brew "leiningen"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for scientific data networking
brew "libdap"
# Portable Foreign Function Interface library
brew "libffi"
# Implementation of the file(1) command
brew "libmagic"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Rainbows and unicorns in your console!
brew "lolcat"
# Fast and user friendly build system
brew "meson"
# Implementation of the Vulkan graphics and compute API on top of Metal
brew "molten-vk"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Open source distributed and RESTful search engine
brew "opensearch", restart_service: :changed
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Swiss-army knife of markup format conversion
brew "pandoc"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# PostgreSQL syntax beautifier
brew "pgformatter"
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Database of common MIME types
brew "shared-mime-info"
# Provides geospatial routing for PostGIS/PostgreSQL database
brew "pgrouting"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Draw UML diagrams
brew "plantuml"
# Library to work with the PDF file format
brew "podofo"
# Cross-platform application and UI framework
brew "qt@5"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler-qt5"
# Object-relational database system
brew "postgresql@14"
# Command-line shell and scripting language
brew "powershell"
# Monitor data's progress through a pipe
brew "pv"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Pretty-print tabular data in Python
brew "python-tabulate"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Cross-platform application and UI framework
brew "qt"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Editor of encrypted files
brew "sops"
# General framework for developing spatial indices
brew "spatialindex"
# Non-validating SQL parser
brew "sqlparse"
# Secure Reliable Transport
brew "srt"
# Version control system designed to be a better CVS
brew "subversion"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# User interface to the TELNET protocol
brew "telnet"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vulkan ICD Loader
brew "vulkan-loader"
# Internet file retriever
brew "wget"
# Automatic workarounds for problems in Wine
brew "winetricks"
# JavaScript package manager
brew "yarn"
# GTK+ dialog boxes for the command-line
brew "zenity"
# High-performance, asynchronous messaging library
brew "zeromq", args: ["HEAD"]
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Native, fast starting Clojure interpreter for scripting.
brew "borkdude/brew/babashka"
brew "babashka/brew/bbin"
# A minimal and opinionated linter for Clojure code that sparks joy.
brew "borkdude/brew/clj-kondo"
# Language Server (LSP) for Clojure
brew "clojure-lsp/brew/clojure-lsp-native"
# Analytics and search dashboard for Elasticsearch
brew "elastic/tap/kibana-full"
# Automated code review tool integrated with any code analysis tools regardless of programming language.
brew "reviewdog/tap/reviewdog"
# Automatically rotate your IAM keys daily
brew "rhyeal/aws-rotate-iam-keys/aws-rotate-iam-keys"
# AI-supervised issue tracker for coding workflows
brew "steveyegge/beads/bd"
# Supabase CLI
brew "supabase/tap/supabase"
# Sound and music editor
cask "ableton-live-lite"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Cryptocurrency exchange
cask "binance"
# Virtual Audio Driver
cask "blackhole-2ch"
# Web browser focusing on privacy
cask "brave-browser"
# Utility that prevents the system from going to sleep
cask "caffeine"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Block websites, games and applications
cask "cold-turkey-blocker"
# UI for creating Windows installer ISO from UUPDump
cask "crystalfetch"
# Server and cloud storage browser
cask "cyberduck"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Database version management tool
cask "dbngin"
# Voice and text chat software
cask "discord"
# Rounds your display corners
cask "displaperture"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Finds duplicate files in a computer system
cask "dupeguru"
# System-wide audio equaliser
cask "eqmac"
# Web browser
cask "firefox"
cask "font-inter"
cask "font-jetbrains-mono"
cask "colindean/fonts-nonfree/font-microsoft-office"
cask "font-source-code-pro"
# Virtual video-calling space
cask "gather"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Solve, save and share math problems, graph functions, etc
cask "geogebra"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Virtual globe
cask "google-earth-pro"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Open-source video transcoder
cask "handbrake-app"
# Utility to hide menu bar items
cask "hiddenbar"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Utility for comparing and merging files and directories
cask "kdiff3"
# Porting tool, to make Windows programs/games into native apps
cask "kegworks-app/kegworks/kegworks"
# File archiver
cask "keka"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Controls and monitors all fans on Apple computers
cask "macs-fan-control"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Markdown editor
cask "markedit"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Online collaborative whiteboard platform
cask "miro"
# Open-source music notation software
cask "musescore"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Menu bar utility for toggling dark mode
cask "nightfall"
# Utility to toggle dark mode
cask "nightowl"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# GUI for streamlined Redis application development
cask "redis-insight"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Tool to format memory cards complying with the SD File System spec
cask "sdformatter"
# Team communication and collaboration software
cask "slack"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Terminal for orchestrating agents
cask "superset"
# Dictation tool including LLM reformatting
cask "superwhisper"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Manage the data on children's Ravensburger tip toi audio pen
cask "tiptoi-manager"
# Web browser focusing on security
cask "tor-browser"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Google Chromium, sans integration with Google
cask "ungoogled-chromium"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Rust-based terminal
cask "warp"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Compatibility layer to run Windows applications
cask "gcenx/wine/wine-crossover"
# Network protocol analyzer
cask "wireshark-app"
# Video communication and virtual meeting platform
cask "zoom"
vscode "4ops.terraform"
vscode "asvetliakov.vscode-neovim"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bradymholt.pgformatter"
vscode "djblue.portal"
vscode "dongfg.vscode-beancount-formatter"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "fr43nk.seito-openfile"
vscode "github.vscode-github-actions"
vscode "gurumukhi.selected-lines-count"
vscode "jannisx11.batch-rename-extension"
vscode "lencerf.beancount"
vscode "lucien-martijn.parquet-visualizer"
vscode "mikoz.autoflake-extension"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "openai.chatgpt"
vscode "openai.openai-chatgpt-adhoc"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "rokoroku.vscode-theme-darcula"
vscode "sandcastle.vscode-open"
vscode "sdras.night-owl"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tomoki1207.pdf"
vscode "usernamehw.commands"
vscode "yzhang.markdown-all-in-one"
